Schematics plan prior to `move` command:
```
 
 2024/12/03 20:17:04 [1m-----  Terraform PLAN  -----[21m[0m
 
 2024/12/03 20:17:04 [34mStarting command: terraform1.6 plan -input=false -refresh=true -state=terraform.tfstate -var-file=schematics.tfvars -no-color -out=tfplan.binary[39m[0m
 2024/12/03 20:17:04 Starting command: terraform1.6 plan -input=false -refresh=true -state=terraform.tfstate -var-file=schematics.tfvars -no-color -out=tfplan.binary
 2024/12/03 20:17:11 Terraform plan | module.resource_group.data.ibm_resource_group.existing_resource_group[0]: Reading...
 2024/12/03 20:17:12 Terraform plan | module.resource_group.data.ibm_resource_group.existing_resource_group[0]: Read complete after 0s [id=19dd055f15844a0ca5b8212a143fc5d1]
 2024/12/03 20:17:12 Terraform plan | module.event_streams.time_sleep.wait_for_authorization_policy: Refreshing state... [id=2024-12-03T18:45:18Z]
 2024/12/03 20:17:12 Terraform plan | module.event_streams.ibm_resource_instance.es_instance: Refreshing state... [id=crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:a6d13218-17bc-43e7-b3aa-125fc7608fd0::]
 2024/12/03 20:17:13 Terraform plan | module.event_streams.ibm_event_streams_topic.es_topic[1]: Refreshing state... [id=crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:a6d13218-17bc-43e7-b3aa-125fc7608fd0:topic:topic_20]
 2024/12/03 20:17:13 Terraform plan | module.event_streams.ibm_event_streams_topic.es_topic[0]: Refreshing state... [id=crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:a6d13218-17bc-43e7-b3aa-125fc7608fd0:topic:topic_10]
 2024/12/03 20:17:13 Terraform plan | module.event_streams.ibm_resource_key.service_credentials["es_writer"]: Refreshing state... [id=crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:a6d13218-17bc-43e7-b3aa-125fc7608fd0:resource-key:468aafe6-854f-498b-85a1-6b2c1c49b366]
 2024/12/03 20:17:13 Terraform plan | module.event_streams.ibm_resource_key.service_credentials["es_reader"]: Refreshing state... [id=crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:a6d13218-17bc-43e7-b3aa-125fc7608fd0:resource-key:5c7cf910-455a-40eb-a69b-bfea058a60ce]
 2024/12/03 20:17:13 Terraform plan | module.event_streams.ibm_resource_key.service_credentials["es_manager"]: Refreshing state... [id=crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:a6d13218-17bc-43e7-b3aa-125fc7608fd0:resource-key:d319e00d-2832-4fcb-b989-5f035d4947d0]
 2024/12/03 20:17:19 Terraform plan | 
 2024/12/03 20:17:19 Terraform plan | Terraform used the selected providers to generate the following execution
 2024/12/03 20:17:19 Terraform plan | plan. Resource actions are indicated with the following symbols:
 2024/12/03 20:17:19 Terraform plan |   + create
 2024/12/03 20:17:19 Terraform plan |   - destroy
 2024/12/03 20:17:19 Terraform plan | 
 2024/12/03 20:17:19 Terraform plan | Terraform will perform the following actions:
 2024/12/03 20:17:19 Terraform plan | 
 2024/12/03 20:17:19 Terraform plan |   # module.event_streams.ibm_event_streams_topic.es_topic[0] will be destroyed
 2024/12/03 20:17:19 Terraform plan |   # (because resource does not use count)
 2024/12/03 20:17:19 Terraform plan |   - resource "ibm_event_streams_topic" "es_topic" {
 2024/12/03 20:17:19 Terraform plan |       - config               = {
 2024/12/03 20:17:19 Terraform plan |           - "cleanup.policy"  = "delete"
 2024/12/03 20:17:19 Terraform plan |           - "retention.bytes" = "209715200"
 2024/12/03 20:17:19 Terraform plan |           - "retention.ms"    = "86400000"
 2024/12/03 20:17:19 Terraform plan |           - "segment.bytes"   = "209715200"
 2024/12/03 20:17:19 Terraform plan |         } -> null
 2024/12/03 20:17:19 Terraform plan |       - id                   = "crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:a6d13218-17bc-43e7-b3aa-125fc7608fd0:topic:topic_10" -> null
 2024/12/03 20:17:19 Terraform plan |       - kafka_brokers_sasl   = [
 2024/12/03 20:17:19 Terraform plan |           - "broker-0-8k2w6nm9z9299rnk.kafka.svc03.us-south.eventstreams.cloud.ibm.com:9093",
 2024/12/03 20:17:19 Terraform plan |           - "broker-1-8k2w6nm9z9299rnk.kafka.svc03.us-south.eventstreams.cloud.ibm.com:9093",
 2024/12/03 20:17:19 Terraform plan |           - "broker-2-8k2w6nm9z9299rnk.kafka.svc03.us-south.eventstreams.cloud.ibm.com:9093",
 2024/12/03 20:17:19 Terraform plan |           - "broker-3-8k2w6nm9z9299rnk.kafka.svc03.us-south.eventstreams.cloud.ibm.com:9093",
 2024/12/03 20:17:19 Terraform plan |           - "broker-4-8k2w6nm9z9299rnk.kafka.svc03.us-south.eventstreams.cloud.ibm.com:9093",
 2024/12/03 20:17:19 Terraform plan |           - "broker-5-8k2w6nm9z9299rnk.kafka.svc03.us-south.eventstreams.cloud.ibm.com:9093",
 2024/12/03 20:17:19 Terraform plan |         ] -> null
 2024/12/03 20:17:19 Terraform plan |       - kafka_http_url       = "https://8k2w6nm9z9299rnk.svc03.us-south.eventstreams.cloud.ibm.com" -> null
 2024/12/03 20:17:19 Terraform plan |       - name                 = "topic_10" -> null
 2024/12/03 20:17:19 Terraform plan |       - partitions           = 3 -> null
 2024/12/03 20:17:19 Terraform plan |       - resource_instance_id = "crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:a6d13218-17bc-43e7-b3aa-125fc7608fd0::" -> null
 2024/12/03 20:17:19 Terraform plan |     }
 2024/12/03 20:17:19 Terraform plan | 
 2024/12/03 20:17:19 Terraform plan |   # module.event_streams.ibm_event_streams_topic.es_topic[1] will be destroyed
 2024/12/03 20:17:19 Terraform plan |   # (because resource does not use count)
 2024/12/03 20:17:19 Terraform plan |   - resource "ibm_event_streams_topic" "es_topic" {
 2024/12/03 20:17:19 Terraform plan |       - config               = {
 2024/12/03 20:17:19 Terraform plan |           - "cleanup.policy"  = "delete"
 2024/12/03 20:17:19 Terraform plan |           - "retention.bytes" = "209715200"
 2024/12/03 20:17:19 Terraform plan |           - "retention.ms"    = "86400000"
 2024/12/03 20:17:19 Terraform plan |           - "segment.bytes"   = "209715200"
 2024/12/03 20:17:19 Terraform plan |         } -> null
 2024/12/03 20:17:19 Terraform plan |       - id                   = "crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:a6d13218-17bc-43e7-b3aa-125fc7608fd0:topic:topic_20" -> null
 2024/12/03 20:17:19 Terraform plan |       - kafka_brokers_sasl   = [
 2024/12/03 20:17:19 Terraform plan |           - "broker-0-8k2w6nm9z9299rnk.kafka.svc03.us-south.eventstreams.cloud.ibm.com:9093",
 2024/12/03 20:17:19 Terraform plan |           - "broker-1-8k2w6nm9z9299rnk.kafka.svc03.us-south.eventstreams.cloud.ibm.com:9093",
 2024/12/03 20:17:19 Terraform plan |           - "broker-2-8k2w6nm9z9299rnk.kafka.svc03.us-south.eventstreams.cloud.ibm.com:9093",
 2024/12/03 20:17:19 Terraform plan |           - "broker-3-8k2w6nm9z9299rnk.kafka.svc03.us-south.eventstreams.cloud.ibm.com:9093",
 2024/12/03 20:17:19 Terraform plan |           - "broker-4-8k2w6nm9z9299rnk.kafka.svc03.us-south.eventstreams.cloud.ibm.com:9093",
 2024/12/03 20:17:19 Terraform plan |           - "broker-5-8k2w6nm9z9299rnk.kafka.svc03.us-south.eventstreams.cloud.ibm.com:9093",
 2024/12/03 20:17:19 Terraform plan |         ] -> null
 2024/12/03 20:17:19 Terraform plan |       - kafka_http_url       = "https://8k2w6nm9z9299rnk.svc03.us-south.eventstreams.cloud.ibm.com" -> null
 2024/12/03 20:17:19 Terraform plan |       - name                 = "topic_20" -> null
 2024/12/03 20:17:19 Terraform plan |       - partitions           = 3 -> null
 2024/12/03 20:17:19 Terraform plan |       - resource_instance_id = "crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:a6d13218-17bc-43e7-b3aa-125fc7608fd0::" -> null
 2024/12/03 20:17:19 Terraform plan |     }
 2024/12/03 20:17:19 Terraform plan | 
 2024/12/03 20:17:19 Terraform plan |   # module.event_streams.ibm_event_streams_topic.es_topic["topic_10"] will be created
 2024/12/03 20:17:19 Terraform plan |   + resource "ibm_event_streams_topic" "es_topic" {
 2024/12/03 20:17:19 Terraform plan |       + config               = {
 2024/12/03 20:17:19 Terraform plan |           + "cleanup.policy"  = "delete"
 2024/12/03 20:17:19 Terraform plan |           + "retention.bytes" = "209715200"
 2024/12/03 20:17:19 Terraform plan |           + "retention.ms"    = "86400000"
 2024/12/03 20:17:19 Terraform plan |           + "segment.bytes"   = "209715200"
 2024/12/03 20:17:19 Terraform plan |         }
 2024/12/03 20:17:19 Terraform plan |       + id                   = (known after apply)
 2024/12/03 20:17:19 Terraform plan |       + kafka_brokers_sasl   = (known after apply)
 2024/12/03 20:17:19 Terraform plan |       + kafka_http_url       = (known after apply)
 2024/12/03 20:17:19 Terraform plan |       + name                 = "topic_10"
 2024/12/03 20:17:19 Terraform plan |       + partitions           = 3
 2024/12/03 20:17:19 Terraform plan |       + resource_instance_id = "crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:a6d13218-17bc-43e7-b3aa-125fc7608fd0::"
 2024/12/03 20:17:19 Terraform plan |     }
 2024/12/03 20:17:19 Terraform plan | 
 2024/12/03 20:17:19 Terraform plan |   # module.event_streams.ibm_event_streams_topic.es_topic["topic_20"] will be created
 2024/12/03 20:17:19 Terraform plan |   + resource "ibm_event_streams_topic" "es_topic" {
 2024/12/03 20:17:19 Terraform plan |       + config               = {
 2024/12/03 20:17:19 Terraform plan |           + "cleanup.policy"  = "delete"
 2024/12/03 20:17:19 Terraform plan |           + "retention.bytes" = "209715200"
 2024/12/03 20:17:19 Terraform plan |           + "retention.ms"    = "86400000"
 2024/12/03 20:17:19 Terraform plan |           + "segment.bytes"   = "209715200"
 2024/12/03 20:17:19 Terraform plan |         }
 2024/12/03 20:17:19 Terraform plan |       + id                   = (known after apply)
 2024/12/03 20:17:19 Terraform plan |       + kafka_brokers_sasl   = (known after apply)
 2024/12/03 20:17:19 Terraform plan |       + kafka_http_url       = (known after apply)
 2024/12/03 20:17:19 Terraform plan |       + name                 = "topic_20"
 2024/12/03 20:17:19 Terraform plan |       + partitions           = 3
 2024/12/03 20:17:19 Terraform plan |       + resource_instance_id = "crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:a6d13218-17bc-43e7-b3aa-125fc7608fd0::"
 2024/12/03 20:17:19 Terraform plan |     }
 2024/12/03 20:17:19 Terraform plan | 
 2024/12/03 20:17:19 Terraform plan | Plan: 2 to add, 0 to change, 2 to destroy.
```

Schematics move commands:
```
> ibmcloud schematics workspace state mv --id us-south.workspace.dev-ies.dc0bc6d2 --source "module.event_streams.ibm_event_streams_topic.es_topic[0]" --destination "module.event_streams.ibm_event_streams_topic.es_topic["topic_10"]"
Job request submitted and here is the activity ID. Please check activity logs

Activity ID   f0a5af94ba257b70bd9c547a6b6a89be

OK

> ic schematics job logs --id 383d8ea46592bf562d9cfd1f39768ad3
...
 2024/12/03 20:25:02 -----  Terraform Commands  -----

 2024/12/03 20:25:02 Starting command: terraform1.6 state mv module.event_streams.ibm_event_streams_topic.es_topic[0] module.event_streams.ibm_event_streams_topic.es_topic["topic_10"]
 2024/12/03 20:25:02 Starting command: terraform1.6 state mv module.event_streams.ibm_event_streams_topic.es_topic[0] module.event_streams.ibm_event_streams_topic.es_topic["topic_10"]
 2024/12/03 20:25:04 Terraform state | Move "module.event_streams.ibm_event_streams_topic.es_topic[0]" to "module.event_streams.ibm_event_streams_topic.es_topic[\"topic_10\"]"
 2024/12/03 20:25:05 Terraform state | Successfully moved 1 object(s).
 2024/12/03 20:25:05 Command finished successfully.
 2024/12/03 20:25:11 Done with the workspace action

OK


> ibmcloud schematics workspace state mv --id us-south.workspace.dev-ies.dc0bc6d2 --source "module.event_streams.ibm_event_streams_topic.es_topic[1]" --destination 'module.event_streams.ibm_event_streams_topic.es_topic["topic_20"]'
Job request submitted and here is the activity ID. Please check activity logs

Activity ID   c5a0d55c7a7c88adc3026e5aee7e1e58

OK

> ic schematics job logs --id c5a0d55c7a7c88adc3026e5aee7e1e58
 2024/12/03 20:27:04 -----  Terraform Commands  -----

 2024/12/03 20:27:04 Starting command: terraform1.6 state mv module.event_streams.ibm_event_streams_topic.es_topic[1] module.event_streams.ibm_event_streams_topic.es_topic["topic_20"]
 2024/12/03 20:27:04 Starting command: terraform1.6 state mv module.event_streams.ibm_event_streams_topic.es_topic[1] module.event_streams.ibm_event_streams_topic.es_topic["topic_20"]
 2024/12/03 20:27:05 Terraform state | Move "module.event_streams.ibm_event_streams_topic.es_topic[1]" to "module.event_streams.ibm_event_streams_topic.es_topic[\"topic_20\"]"
 2024/12/03 20:27:06 Terraform state | Successfully moved 1 object(s).
 2024/12/03 20:27:06 Command finished successfully.
 2024/12/03 20:27:11 Done with the workspace action

OK
```

Schematics plan after `move` command:
```
 2024/12/03 20:28:35 [1m-----  Terraform PLAN  -----[21m[0m
 
 2024/12/03 20:28:35 [34mStarting command: terraform1.6 plan -input=false -refresh=true -state=terraform.tfstate -var-file=schematics.tfvars -no-color -out=tfplan.binary[39m[0m
 2024/12/03 20:28:35 Starting command: terraform1.6 plan -input=false -refresh=true -state=terraform.tfstate -var-file=schematics.tfvars -no-color -out=tfplan.binary
 2024/12/03 20:28:43 Terraform plan | module.resource_group.data.ibm_resource_group.existing_resource_group[0]: Reading...
 2024/12/03 20:28:43 Terraform plan | module.resource_group.data.ibm_resource_group.existing_resource_group[0]: Read complete after 1s [id=19dd055f15844a0ca5b8212a143fc5d1]
 2024/12/03 20:28:43 Terraform plan | module.event_streams.time_sleep.wait_for_authorization_policy: Refreshing state... [id=2024-12-03T18:45:18Z]
 2024/12/03 20:28:43 Terraform plan | module.event_streams.ibm_resource_instance.es_instance: Refreshing state... [id=crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:a6d13218-17bc-43e7-b3aa-125fc7608fd0::]
 2024/12/03 20:28:45 Terraform plan | module.event_streams.ibm_resource_key.service_credentials["es_writer"]: Refreshing state... [id=crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:a6d13218-17bc-43e7-b3aa-125fc7608fd0:resource-key:468aafe6-854f-498b-85a1-6b2c1c49b366]
 2024/12/03 20:28:45 Terraform plan | module.event_streams.ibm_event_streams_topic.es_topic["topic_20"]: Refreshing state... [id=crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:a6d13218-17bc-43e7-b3aa-125fc7608fd0:topic:topic_20]
 2024/12/03 20:28:45 Terraform plan | module.event_streams.ibm_resource_key.service_credentials["es_manager"]: Refreshing state... [id=crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:a6d13218-17bc-43e7-b3aa-125fc7608fd0:resource-key:d319e00d-2832-4fcb-b989-5f035d4947d0]
 2024/12/03 20:28:45 Terraform plan | module.event_streams.ibm_event_streams_topic.es_topic["topic_10"]: Refreshing state... [id=crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:a6d13218-17bc-43e7-b3aa-125fc7608fd0:topic:topic_10]
 2024/12/03 20:28:45 Terraform plan | module.event_streams.ibm_resource_key.service_credentials["es_reader"]: Refreshing state... [id=crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:a6d13218-17bc-43e7-b3aa-125fc7608fd0:resource-key:5c7cf910-455a-40eb-a69b-bfea058a60ce]
 2024/12/03 20:28:47 Terraform plan | 
 2024/12/03 20:28:47 Terraform plan | No changes. Your infrastructure matches the configuration.
 2024/12/03 20:28:47 Terraform plan | 
 2024/12/03 20:28:47 Terraform plan | Terraform has compared your real infrastructure against your configuration
 2024/12/03 20:28:47 Terraform plan | and found no differences, so no changes are needed.
```